trade/src/Catalogs/КлассификаторТранспортныхСредствСАТУРН/КлассификаторТранспортныхСредствСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторТранспортныхСредствСАТУРН</name>
  <predefined>
    <items>
      <name>АвтомобильныйТранспорт</name>
      <description>Автомобильный транспорт</description>
    </items>
    <items>
      <name>ЖелезнодородныйТранспорт</name>
      <description>Железнодородный транспорт</description>
    </items>
    <items>
      <name>АвиационноеСообщение</name>
      <description>Авиационное сообщение</description>
    </items>
    <items>
      <name>МорскоеСообщение</name>
      <description>Морское сообщение</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

trade/src/Enums/ДальнейшиеДействияПоВзаимодействиюСАТУРН/ДальнейшиеДействияПоВзаимодействиюСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДальнейшиеДействияПоВзаимодействиюСАТУРН</name>
  <enumValues>
    <name>АннулируйтеОперацию</name>
  </enumValues>
  <enumValues>
    <name>ВернитеНакладную</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеОбмен</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузитеПартииИмпорта</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузитеКлассификатор</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеЗавершенияОбработкиДанных</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПередачуДанныхРегламентнымЗаданием</name>
  </enumValues>
  <enumValues>
    <name>ОтклонитеЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ОтменитеОперацию</name>
  </enumValues>
  <enumValues>
    <name>ОтменитеПередачуДанных</name>
  </enumValues>
  <enumValues>
    <name>ОтменитьВвоз</name>
  </enumValues>
  <enumValues>
    <name>ОформитеОтгрузкуИмпортаИзЕЭАС</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанные</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеНаДосмотр</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеВозврат</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеВозвратЧастично</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеИмпорт</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеНакладную</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеУтерюГруза</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеУтерюПриВозврате</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеУтерюПриВозвратеЧастично</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеУтилизацию</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеЭкспорт</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/ВидыОперацийСАТУРН/ВидыОперацийСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСАТУРН</name>
  <enumValues>
    <name>АктИнвентаризацииИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>АктИнвентаризацииПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>АктИнвентаризацииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>АктИнвентаризацииСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>АктИнвентаризацииЧтениеАктуальногоОстатка</name>
  </enumValues>
  <enumValues>
    <name>АктИнвентаризацииЧтениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>АктПримененияАннулирование</name>
  </enumValues>
  <enumValues>
    <name>АктПримененияИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>АктПримененияПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>АктПримененияРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>АктПримененияСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ГенерацияТокенаАвторизации</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаКлассификаторов</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковПартий</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковПартийЗапросРодительскихПартий</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковПартийРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ИмпортируемаяПартияЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукции</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииИзЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииОтменаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииПодтверждениеПриемки</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииПредварительноеУведомление</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииПредварительноеУведомлениеИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииПредварительноеУведомлениеПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииПредварительноеУведомлениеСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииПриемкаИзЕАЭСИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииПриемкаИзЕАЭСПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииПриемкаИзЕАЭССозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииРасчетСтатусовПоДокументу</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПродукцииЧтениеПартий</name>
  </enumValues>
  <enumValues>
    <name>МестоПримененияЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>МестоПримененияСозданиеКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>МестоХраненияЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>МестоХраненияСозданиеКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяВозврат</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяВозвратИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяВозвратРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяГрузУтерян</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяГрузУтерянАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяГрузУтерянИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяГрузУтерянРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаДокументов</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаДокументовРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаДокументовЧтение</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаСтатусов</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаСтатусовРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЗагрузкаСтатусовЧтение</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПеревозка</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПеревозкаАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеАннулированиеРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеВозврата</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеВозвратаАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеВозвратаИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеВозвратаРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеПриемки</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеУтериГрузаПриВозврате</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеУтериГрузаПриВозвратеАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеУтериГрузаПриВозвратеИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеУтериГрузаПриВозвратеРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеУтериГрузаПриВозвратеЧастично</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеЧастичногоВозврата</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеЧастичногоВозвратаАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеЧастичнойПриемки</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеЧастичнойПриемкиАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПодтверждениеЧтение</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяРозничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяРозничнаяТорговляАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяСписаниеВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяСписаниеВПроизводствоАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяУтилизация</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяУтилизацияАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяУтилизацияАннулированиеПодтверждения</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяУтилизацияПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЧтениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортАннулирование</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортОтказ</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортОтказИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортОтказРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортПодтверждениеИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортПодтверждениеПриемаНаДосмотр</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортПодтверждениеПриемаНаДосмотрИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортПодтверждениеПриемаНаДосмотрРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортПодтверждениеРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортЧерезПунктДосмотра</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяЭкспортЧерезПунктДосмотраАннулирование</name>
  </enumValues>
  <enumValues>
    <name>ОбновлениеКлючаАвторизации</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияИзменениеКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияСменаСтатусаИзЧерновикаВАктуально</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияСменаСтатусаИзЧерновикаВОтменено</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияСозданиеКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ПартияЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ПАТЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ПАТИзменениеКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ПАТСменаСтатусаИзЧерновикаВОтменено</name>
  </enumValues>
  <enumValues>
    <name>ПАТСменаСтатусаИзЧерновикВАктуально</name>
  </enumValues>
  <enumValues>
    <name>ПАТСозданиеКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияАннулирование</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияРасчетСтатусовПоДокументу</name>
  </enumValues>
  <enumValues>
    <name>ПланПримененияСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияАннулирование</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияСозданиеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственнаяОперацияЧтениеДокумента</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/КлассификаторТранспортныхСредствСАТУРН/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" Тогда
	
		Если Параметры = Неопределено Тогда
			Параметры = Новый Структура();
		КонецЕсли;
		
		Параметры.Вставить("РежимВыбора", Истина);
		
		ВыбраннаяФорма       = "Справочник.КлассификаторТранспортныхСредствСАТУРН.Форма.ФормаСписка";
		СтандартнаяОбработка = Ложь;
	
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Сообщения

// Сообщение к передаче JSON.
//
// Параметры:
//  СправочникСсылка - СправочникСсылка.КлассификаторТранспортныхСредствСАТУРН - Ссылка на страну.
//  ДальнейшееДействие - ПеречислениеСсылка.ДальнейшиеДействияПоВзаимодействиюСАТУРН - Дальнейшее действие.
//  ДополнительныеПараметры - Структура, Неопределено - Дополнительные параметры.
//
// Возвращаемое значение:
//  Массив Из См. ИнтеграцияСАТУРНСлужебный.СтруктураСообщенияJSON - Сообщения к передаче.
//
Функция СообщениеКПередачеJSON(СправочникСсылка, ДальнейшееДействие, ДополнительныеПараметры = Неопределено) Экспорт
	
	СообщенияJSON = Новый Массив;
	
	Если ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюСАТУРН.ЗагрузитеКлассификатор Тогда
		
		Возврат ЗагрузкаКлассификатораТранспортныхСредствJSON(ДополнительныеПараметры);
		
	КонецЕсли;

	Возврат СообщенияJSON;
	
КонецФункции

Процедура ОбработкаЗагрузкиПолученныхДанных(ЭлементОчереди, ПараметрыОбмена, ПолученныеДанные, ИзмененныеОбъекты) Экспорт
	
	Если ЭлементОчереди.Операция = ОперацияЗагрузкиКлассификатора() Тогда
		
		ВходящиеДанные = ИнтеграцияСАТУРНСлужебный.ОбработатьРезультатЗапросаСпискаОбъектов(
			ПустаяСсылка().Метаданные(), ПолученныеДанные, ПараметрыОбмена);
		ИнтеграцияСАТУРНСлужебный.СсылкиПоИдентификаторам(ПараметрыОбмена, ИзмененныеОбъекты);
		
		Попытка
			
			Для Каждого ЭлементДанных Из ВходящиеДанные Цикл
				
				ДанныеОбъекта   = ДанныеОбъекта(ЭлементДанных);
				СсылкаНаЭлемент = ЗагрузитьОбъект(ДанныеОбъекта, ПараметрыОбмена,,, ЭлементОчереди.ОрганизацияСАТУРН);
				
				Если Не ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
					Продолжить;
				КонецЕсли;
				ИзмененныеОбъекты.Добавить(СсылкаНаЭлемент);
				
			КонецЦикла;
			
		Исключение
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обмен

// Данные объекта.
// 
// Параметры:
//  ЭлементДанных - Произвольный - Элемент данных
// 
// Возвращаемое значение:
//  Структура - Данные объекта:
// * Идентификатор - Строка
// * Наименование - Строка - наименование транспортного средства
// * КодТС - Строка - Код вида ТС
Функция ДанныеОбъекта(ЭлементДанных) Экспорт
	
	ДанныеТранспортногоСредства     = Новый Структура;
	ФорматОтображенияИдентификатора = "ЧРД=; ЧРГ=; ЧГ=;";
	
	ДанныеТранспортногоСредства.Вставить("Идентификатор", Формат(ЭлементДанных.id, ФорматОтображенияИдентификатора));
	ДанныеТранспортногоСредства.Вставить("Наименование",  ЭлементДанных.transportName);
	ДанныеТранспортногоСредства.Вставить("КодТС",         ЭлементДанных.transportCode);
	
	Возврат ДанныеТранспортногоСредства;
	
КонецФункции

Функция ОперацияЗагрузкиКлассификатора() Экспорт
	Возврат Перечисления.ВидыОперацийСАТУРН.ЗагрузкаКлассификаторов;
КонецФункции

#КонецОбласти

#Область ПоискСсылок

Функция КлассификаторТС(ЗначениеИдентификатора, ПараметрыОбмена, ОрганизацияСАТУРН = Неопределено) Экспорт
	
	Идентификатор = Формат(ЗначениеИдентификатора, "ЧГ=0;");
	Если Не ЗначениеЗаполнено(Идентификатор)
		Или ЗначениеИдентификатора = -1 Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	ИмяТаблицы       = Метаданные.Справочники.КлассификаторТранспортныхСредствСАТУРН.ПолноеИмя();
	СправочникСсылка = ИнтеграцияСАТУРНСлужебный.СсылкаПоИдентификатору(ПараметрыОбмена, ИмяТаблицы, Идентификатор);
	
	Если ЗначениеЗаполнено(СправочникСсылка) Тогда
		ИнтеграцияСАТУРНСлужебный.ОбновитьСсылку(ПараметрыОбмена, ИмяТаблицы, Идентификатор, СправочникСсылка);
	Иначе
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицы);
		ЭлементБлокировки.УстановитьЗначение("Идентификатор", Идентификатор);
		
		ТранзакцияЗафиксирована = Истина;
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка.Заблокировать();
			
			СправочникСсылка = ИнтеграцияСАТУРНСлужебный.СсылкаПоИдентификатору(ПараметрыОбмена, ИмяТаблицы, Идентификатор);
			
			Если Не ЗначениеЗаполнено(СправочникСсылка) Тогда
				ДанныеОбъекта = ИнтеграцияСАТУРНСлужебный.ДанныеОбъекта(
					Идентификатор,
					Метаданные.Справочники.КлассификаторТранспортныхСредствСАТУРН, ПараметрыОбмена);
				Если ДанныеОбъекта = Неопределено Тогда
					СправочникСсылка = СоздатьТранспортноеСредство(Идентификатор, ПараметрыОбмена);
					ИнтеграцияСАТУРНСлужебный.ДобавитьКЗагрузке(ПараметрыОбмена, ИмяТаблицы, Идентификатор, СправочникСсылка, ОрганизацияСАТУРН);
				Иначе
					СправочникСсылка = ЗагрузитьОбъект(ДанныеОбъекта, ПараметрыОбмена,, Ложь, ОрганизацияСАТУРН);
				КонецЕсли;
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТранзакцияЗафиксирована = Ложь;
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Ошибка при создании транспортного средства с идентификатором %1:
				           |%2'"),
				Идентификатор,
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ТекстОшибкиПодробно = СтрШаблон(
				НСтр("ru = 'Ошибка при создании транспортного средства с идентификатором %1:
				           |%2'"),
				Идентификатор,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ОбщегоНазначенияИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
				ТекстОшибкиПодробно,
				НСтр("ru = 'Работа с классификатором транспортных средств'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
		Если ТранзакцияЗафиксирована Тогда
			ИнтеграцияСАТУРНСлужебный.ОбновитьСсылку(ПараметрыОбмена, ИмяТаблицы, Идентификатор, СправочникСсылка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СправочникСсылка;
	
КонецФункции

Функция ЗагрузитьОбъекты(СписокКлассификатораТранспортныхСредств, ПараметрыОбмена, ОрганизацияСАТУРН = Неопределено) Экспорт
	
	ИзмененныеОбъекты = Новый Массив;
	
	Если СписокКлассификатораТранспортныхСредств.Количество() = 0 Тогда
		Возврат ИзмененныеОбъекты;
	КонецЕсли;
	
	ВходящиеДанные = ИнтеграцияСАТУРНСлужебный.ОбработатьРезультатЗапросаСпискаОбъектов(
		ПустаяСсылка().Метаданные(), СписокКлассификатораТранспортныхСредств, ПараметрыОбмена);
	ИнтеграцияСАТУРНСлужебный.СсылкиПоИдентификаторам(ПараметрыОбмена, ИзмененныеОбъекты);
	
	Попытка
		
		Для Каждого ЭлементДанных Из ВходящиеДанные Цикл
			
			ДанныеОбъекта   = ДанныеОбъекта(ЭлементДанных);
			СсылкаНаЭлемент = ЗагрузитьОбъект(ДанныеОбъекта, ПараметрыОбмена);
			
			Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
				ИзмененныеОбъекты.Добавить(СсылкаНаЭлемент);
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ИзмененныеОбъекты;
	
КонецФункции

Функция ЗагрузитьОбъект(ДанныеТранспортногоСредства, ПараметрыОбмена, СправочникОбъект = Неопределено, ТребуетсяПоиск = Истина, ОрганизацияСАТУРН = Неопределено) Экспорт
	
	Если ДанныеТранспортногоСредства = Неопределено Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	ЗаписьНового  = Ложь;
	ИмяТаблицы    = Метаданные.Справочники.КлассификаторТранспортныхСредствСАТУРН.ПолноеИмя();
	Идентификатор = Формат(ДанныеТранспортногоСредства.Идентификатор, "ЧРГ=; ЧГ=;");
	
	Если СправочникОбъект = Неопределено Тогда
		
		СправочникСсылка = Неопределено;
		Если ТребуетсяПоиск Тогда
			СправочникСсылка = ИнтеграцияСАТУРНСлужебный.СсылкаПоИдентификатору(
				ПараметрыОбмена, ИмяТаблицы, Идентификатор);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СправочникСсылка) Тогда
			
			СправочникОбъект = СоздатьЭлемент();
			СправочникОбъект.Заполнить(Неопределено);
			
			ИдентификаторОбъекта = Новый УникальныйИдентификатор();
			СправочникОбъект.УстановитьСсылкуНового(ПолучитьСсылку(ИдентификаторОбъекта));
			ЗаписьНового = Истина;
			
		ИначеЕсли ДанныеТранспортногоСредства.Идентификатор = 1 Тогда
			СправочникОбъект = АвтомобильныйТранспорт.ПолучитьОбъект();
		ИначеЕсли ДанныеТранспортногоСредства.Идентификатор = 2 Тогда
			СправочникОбъект = ЖелезнодородныйТранспорт.ПолучитьОбъект();
		ИначеЕсли ДанныеТранспортногоСредства.Идентификатор = 3 Тогда
			СправочникОбъект = АвиационноеСообщение.ПолучитьОбъект();
		ИначеЕсли ДанныеТранспортногоСредства.Идентификатор = 4 Тогда
			СправочникОбъект = МорскоеСообщение.ПолучитьОбъект();
		Иначе
			СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗаписьНового Тогда
		СправочникОбъект.Заблокировать();
	КонецЕсли;
	
	СправочникОбъект.Наименование  = ДанныеТранспортногоСредства.Наименование;
	СправочникОбъект.Идентификатор = Идентификатор;
	СправочникОбъект.КодТС         = ДанныеТранспортногоСредства.КодТС;
	
	СправочникОбъект.ТребуетсяЗагрузка = Ложь;
	СправочникОбъект.Записать();
	
	ИнтеграцияСАТУРНСлужебный.ОбновитьСсылку(
		ПараметрыОбмена,
		ИмяТаблицы,
		ДанныеТранспортногоСредства.Идентификатор,
		СправочникОбъект.Ссылка);
	
	Возврат СправочникОбъект.Ссылка;
	
КонецФункции

Функция СоздатьТранспортноеСредство(Идентификатор, ПараметрыОбмена)
	
	СправочникОбъект = СоздатьЭлемент();
	СправочникОбъект.Идентификатор     = Идентификатор;
	СправочникОбъект.ТребуетсяЗагрузка = Истина;
	СправочникОбъект.Наименование      = НСтр("ru = '<Требуется загрузка>'");
	
	СправочникОбъект.Записать();
	
	Возврат СправочникОбъект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Сообщения

Функция ЗагрузкаКлассификатораТранспортныхСредствJSON(ПараметрыОбмена)
	
	СообщенияJSON  = Новый Массив;
	
	СообщениеJSON = ИнтеграцияСАТУРНСлужебный.СтруктураСообщенияJSON();
	СообщениеJSON.Документ            = ПустаяСсылка();
	СообщениеJSON.Версия              = 1;
	СообщениеJSON.Операция            = ОперацияЗагрузкиКлассификатора();
	СообщениеJSON.Описание            = ИнтеграцияСАТУРНСлужебный.ОписаниеОперацииПередачиДанных(СообщениеJSON.Операция);
	СообщениеJSON.АргументыОперации   = ИнтерфейсСАТУРН.АргументыОперации();
	
	АргументыЗапроса = СообщениеJSON.АргументыОперации;
	ИмяСловаря = "transport";
	
	ИнтерфейсСАТУРН.ДобавитьАргумент(АргументыЗапроса, "dictionary", ИмяСловаря);
	
	СообщенияJSON.Добавить(СообщениеJSON);
	
	Возврат СообщенияJSON;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
